app/views/comments/_comment.html.haml

-@news.comments.each do |c|
  .comment
---
SELECT "comments".* FROM "comments" WHERE ("comments".news_id = 1)