app/views/news/_news.html.haml

    |
    =link_to "Przeczytaj komentarze (#{news.comments.size})", show_path(news.cached_slug)+'#comments'
---
SELECT "comments".* FROM "comments" WHERE ("comments".news_id = 1)
SELECT "slugs".* FROM "slugs" WHERE ("slugs".sluggable_id = 1 AND "slugs".sluggable_type = 'Player') ORDER BY id DESC LIMIT 1
SELECT COUNT(*) FROM "comments" WHERE ("comments".news_id = 1)