app/views/news/show.html.haml

SELECT "comments".* FROM "comments" WHERE ("comments".news_id = 1)
---
%h2 Komentarze
-@news.comments.each do |c|
  .comment