app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])
      if @comment.save
---
INSERT INTO "comments" ("news_id", "player_id", "body", "created_at", "updated_at") VALUES (NULL, NULL, 'hehe', '2011-10-22 00:26:13.802843', '2011-10-22 00:26:13.802843')