app/controllers/news_controller.rb

  def index
    @news = News.all.paginate(:per_page => 3, :page => params[:page], :order => 'created_at DESC')
---
SELECT "news".* FROM "news"

  def show
    @news = News.find(params[:cached_slug])
---
SELECT "news".* FROM "news" WHERE "news"."cached_slug" = 'zmiany-zmiany-zmiany' LIMIT 1
SELECT "slugs".* FROM "slugs" WHERE ("slugs".sluggable_id = 1 AND "slugs".sluggable_type = 'Player') ORDER BY id DESC LIMIT 1