app/controllers/players_controller.rb

  def show
    @player = Player.find(params[:cached_slug])
---
SELECT "players".* FROM "players" WHERE "players"."id" = 1 LIMIT 1
SELECT "slugs".* FROM "slugs" WHERE ("slugs".sluggable_id = 1 AND "slugs".sluggable_type = 'Player') ORDER BY id DESC LIMIT 1

  def create
    @player = Player.new(params[:player])
    if @player.save
---
INSERT INTO "players" ("name", "password_hash", "password_salt", "created_at", "updated_at", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES ('hehe', '$2a$10$m9aIvzieR84mQpxbvq.1iekQcq1jFlCqpgVnk9tSmlbrYsZaqAI.2', '$2a$10$m9aIvzieR84mQpxbvq.1ie', '2011-11-06 00:02:30.481127', '2011-11-06 00:02:30.481127', NULL, NULL, NULL, NULL)

  def update
    @player = current_player
      if @player.update_attributes(params[:player])
---
UPDATE "players" SET "name" = 'Samuel Diaza', "password_salt" = '$2a$10$gWkvkQ3gnOnd.c0SvWI3ee', "password_hash" = '$2a$10$gWkvkQ3gnOnd.c0SvWI3eeaHJDO65DPn3P6YHEjtZyKTaJ8L3Nf32', "updated_at" = '2011-10-19 17:47:39.362369' WHERE "players"."id" = 1